app/views/cart/index.html.erb

<% if @cart.items.empty? %>
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["cart_id", 269], ["item_id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = ? LIMIT ?  [["cart_id", 269], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = ?  [["cart_id", 269]]