app/views/cart/index.pdf.erb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["cart_id", 305], ["item_id", 3], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = ?  [["cart_id", 305]]
---

    <% @cart.items.each do |i| %>