app/controllers/admin_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."email" ASC
SELECT "items".* FROM "items" ORDER BY "items"."name" ASC
---
    def info
      @users = User.all.order(:email)
      @items = Item.all.order(:name)