app/controllers/cart_controller.rb

  def remove_item
    @cart.items.delete(Item.where(id: params[:id]))
---
DELETE FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."item_id" = 4  [["cart_id", 305]]
SELECT "items".* FROM "items" WHERE "items"."id" = ?  [["id", 4]]