app/controllers/items_controller.rb

    def index
       # UserNotifierMailer.welcome(User.first).deliver_now
        @items = Item.all
        @maxPrice = @items.map(&:price).max
        @minPrice = @items.map(&:price).min
        @maxVotes = @items.map(&:votes_count).max
        @minVotes = @items.map(&:votes_count).min
        @items = Item.search(params[:term], params[:page])
---
SELECT "items".* FROM "items"
SELECT COUNT(*) FROM "items" WHERE (price >= '5') AND (price <= '60') AND (votes_count >= '0') AND (votes_count <= '14')
SELECT  "items".* FROM "items" WHERE (price >= '5') AND (price <= '60') AND (votes_count >= '0') AND (votes_count <= '14') ORDER BY votes_count DESC, price LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

    def upvote
        @item.increment!(:votes_count)
---
UPDATE "items" SET "votes_count" = COALESCE("votes_count", 0) + 1 WHERE "items"."id" = ?  [["id", 3]]

    def find_item
       @item = Item.where(id: params[:id]).first
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]